// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   TZoneStrings.uni
// 
// Abstract:
//  
//   String definitions for the Shell tzone command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_TZONE_INVALID_VALUE        #language eng  "%hs: Value does not exist, '%s%d:%02d'\n"                                       

#string STR_TZONE_GMT_FMT              #language eng  "GMT%s%02d:%02d\n"

#string STR_TZONE_GMT_N720            #language eng  "GMT-12:00, International Date Line West\n"

#string STR_TZONE_GMT_N660            #language eng  "GMT-11:00, Midway Island, Samoa\n"

#string STR_TZONE_GMT_N600            #language eng  "GMT-10:00, Hawaii\n"

#string STR_TZONE_GMT_N540            #language eng  "GMT-09:00, Alaska\n"

#string STR_TZONE_GMT_N480            #language eng  "GMT-08:00, Pacific Time(US & Canada); Tijuana\n"

#string STR_TZONE_GMT_N420            #language eng  "GMT-07:00, Arizona, Chihuahua, La Paz, Mazatlan\n"

#string STR_TZONE_GMT_N360            #language eng  "GMT-06:00, Central America, Central Time(US & Canada)\n"

#string STR_TZONE_GMT_N300            #language eng  "GMT-05:00, Bogota, Lima, Quito, Eastern Time(US & Canada)\n"                                       

#string STR_TZONE_GMT_N240            #language eng  "GMT-04:00, Atlantic Time(Canada), Caracas, Santiago\n"                                       

#string STR_TZONE_GMT_N210            #language eng  "GMT-03:30, Newfoundland\n"

#string STR_TZONE_GMT_N180            #language eng  "GMT-03:00, Brasilia, Buenos Aires, Georgetown, Greenland\n"

#string STR_TZONE_GMT_N120            #language eng  "GMT-02:00, Mid-Atlantic\n"

#string STR_TZONE_GMT_N060            #language eng  "GMT-01:00, Azores, Cape Verde Is.\n"

#string STR_TZONE_GMT_000             #language eng  "GMT,       Greenwich Mean Time, Casablanca, Monrovia, Dublin, London\n"

#string STR_TZONE_GMT_P060            #language eng  "GMT+01:00, Amsterdam, Berlin, Bern, Rome, Paris, West Central Africa\n"

#string STR_TZONE_GMT_P120            #language eng  "GMT+02:00, Athens, Istanbul, Bucharest, Cairo, Jerusalem\n"                                       

#string STR_TZONE_GMT_P180            #language eng  "GMT+03:00, Baghdad, Kuwait, Riyadh, Moscow, Nairobi\n"                                      

#string STR_TZONE_GMT_P210            #language eng  "GMT+03:30, Tehran\n"

#string STR_TZONE_GMT_P240            #language eng  "GMT+04:00, Abu Dhabi, Muscat, Baku, Tbilisi, Yerevan\n"                                                                           

#string STR_TZONE_GMT_P270            #language eng  "GMT+04:30, Kabul\n"

#string STR_TZONE_GMT_P300            #language eng  "GMT+05:00, Ekaterinburg, Islamabad, Karachi, Tashkent\n"                                                                              

#string STR_TZONE_GMT_P330            #language eng  "GMT+05:30, Chennai, Kolkata, Mumbai, New Delhi\n"                                       

#string STR_TZONE_GMT_P345            #language eng  "GMT+05:45, Kathmandu\n"

#string STR_TZONE_GMT_P360            #language eng  "GMT+06:00, Almaty, Novosibirsk, Astana, Dhaka, Sri Jayawardenepura\n"

#string STR_TZONE_GMT_P390            #language eng  "GMT+06:30, Rangoon\n"

#string STR_TZONE_GMT_P420            #language eng  "GMT+07:00, Bangkok, Hanio, Jakarta, Krasnoyarsk\n"                                                                                                                                                            

#string STR_TZONE_GMT_P480            #language eng  "GMT+08:00, Beijing, Chongqing, Hong Kong, Urumqi, Taipei, Perth\n"                                       

#string STR_TZONE_GMT_P540            #language eng  "GMT+09:00, Osaka, Sapporo, Tokyo, Seoul, Yakutsk\n"

#string STR_TZONE_GMT_P570            #language eng  "GMT+09:30, Adelaide, Darwin\n"

#string STR_TZONE_GMT_P600            #language eng  "GMT+10:00, Canberra, Melbourne, Sydney, Guam, Hobart, Vladivostok\n"                                                                              

#string STR_TZONE_GMT_P660            #language eng  "GMT+11:00, Magadan, Solomon Is., New Caledonia\n"                                       

#string STR_TZONE_GMT_P720            #language eng  "GMT+12:00, Auckland, Wellington, Fiji, Kamchatka, Marshall Is.\n"

#string STR_TZONE_GMT_P780            #language eng  "GMT+13:00, Nuku'alofa\n"

#string STR_HELPINFO_TZONE_SYNTAX      #language eng  "TIMEZONE [-s hh:mm | -l] [-b] [-f]\n"

#string STR_GET_TIME_ERROR             #language eng  "GetTime info return Error\n"

#string STR_HELPINFO_TZONE_LINEHELP    #language eng  "Displays or sets time zone information"

#string STR_HELPINFO_TZONE_VERBOSEHELP #language eng  "Displays or sets time zone information.\n"
                                                      "\n"
                                                      "TIMEZONE [-s hh:mm | -l] [-b] [-f]\n"
                                                      "\n"
                                                      "    -s hh:mm - Set time zone associated with hh:mm offset from GMT\n"
                                                      "    -l       - Display list of all time zones\n"
                                                      "    -b       - Display one screen at a time\n"
                                                      "    -f       - Display full information for specified timezone\n"                                                      
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display all available time zones:\n"
                                                      "    Shell> timezone -l\n"
                                                      "    GMT-12:00, International Date Line West\n"
                                                      "    GMT-11:00, Midway Island, Samoa\n"
                                                      "    GMT-10:00, Hawaii\n"
                                                      "    GMT-09:00, Alaska\n"
                                                      "    GMT-08:00, Pacific Time(US & Canada); Tijuana\n"
                                                      "    GMT-07:00, Arizona, Chihuahua, La Paz, Mazatlan\n"
                                                      "    GMT-06:00, Central America, Central Time(US & Canada)\n"
                                                      "    GMT-05:00, Bogota, Lima, Quito, Eastern Time(US & Canada)\n"
                                                      "    GMT-04:00, Atlantic Time(Canada), Caracas, Santiago\n"
                                                      "    GMT-03:30, Newfoundland\n"
                                                      "    GMT-03:00, Brasilia, Buenos Aires, Georgetown, Greenland\n"
                                                      "    GMT-02:00, Mid-Atlantic\n"
                                                      "    GMT-01:00, Azores, Cape Verde Is.\n"
                                                      "    GMT,       Greenwich Mean Time, Casablanca, Monrovia, Dublin, London\n"
                                                      "    GMT+01:00, Amsterdam, Berlin, Bern, Rome, Paris, West Central Africa\n"
                                                      "    GMT+02:00, Athens, Istanbul, Bucharest, Cairo, Jerusalem\n"
                                                      "    GMT+03:00, Baghdad, Kuwait, Riyadh, Moscow, Nairobi\n"
                                                      "    GMT+03:30, Tehran\n"
                                                      "    GMT+04:00, Abu Dhabi, Muscat, Baku, Tbilisi, Yerevan\n"
                                                      "    GMT+04:30, Kabul\n"
                                                      "    GMT+05:00, Ekaterinburg, Islamabad, Karachi, Tashkent\n"
                                                      "    GMT+05:30, Chennai, Kolkata, Mumbai, New Delhi\n"
                                                      "    GMT+05:45, Kathmandu\n"
                                                      "    GMT+06:00, Almaty, Novosibirsk, Astana, Dhaka, Sri Jayawardenepura\n"
                                                      "    GMT+06:30, Rangoon\n"
                                                      "    GMT+07:00, Bangkok, Hanio, Jakarta, Krasnoyarsk\n"
                                                      "    GMT+08:00, Beijing, Chongqing, Hong Kong, Urumqi, Taipei, Perth\n"
                                                      "    GMT+09:00, Osaka, Sapporo, Tokyo, Seoul, Yakutsk\n"
                                                      "    GMT+09:30, Adelaide, Darwin\n"
                                                      "    GMT+10:00, Canberra, Melbourne, Sydney, Guam, Hobart, Vladivostok\n"
                                                      "    GMT+11:00, Magadan, Solomon Is., New Caledonia\n"
                                                      "    GMT+12:00, Auckland, Wellington, Fiji, Kamchatka, Marshall Is.\n"
                                                      "    GMT+13:00, Nuku'alofa\n"
                                                      "\n"
                                                      "  * To set the time zone:\n"
                                                      "    Shell> timezone -s -7:00\n"
                                                      "    Shell> timezone\n"
                                                      "    GMT-07:00\n"
                                                      "\n"
                                                      "    Shell> timezone -s 5:00\n"
                                                      "    Shell> timezone\n"
                                                      "    GMT+05:00\n"
                                                      "\n"
                                                      "  * To display detailed information for the current time zone:\n"
                                                      "    Shell> timezone -f\n"
                                                      "    GMT+05:00, Ekaterinburg, Islamabad, Karachi, Tashkent\n"
                                                      "    Shell> timezone\n"
                                                      "    GMT+05:00\n"
